Config/DataProcessors/ШтрихкодированиеНоменклатурыПрейскуранта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ШтрихкодированиеНоменклатурыПрейскуранта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Catalogs/Прейскурант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Прейскурант</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСтатьяАналитикиОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиАналитикиОплатыЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятаСПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыДоговораПлатежногоАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыДоговораПлатежногоАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьПриФормированииАктаОбОказанииУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТРУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможнаОплатаЭС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВоВторичнойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ШтрихкодированиеНоменклатурыПрейскуранта/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	
	ТаблицаШтрихкодов.Загрузить(ПолучитьСписокТоваров());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазрешатьИзменятьСуществующиеШтрихкодыПриИзменении(Элемент)
	Если НЕ РазрешатьИзменятьСуществующиеШтрихкоды Тогда
		СнятьПометкиСоСтрокСШК();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПометки(Команда)
	ИзменитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	ИзменитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	ИзменитьПометки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиВсемБезШК(Команда)
	ИзменитьПометки(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьШК(Команда)
	СформироватьШтрихкоды();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокТоваров()
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Прейскурант.Ссылка КАК Номенклатура,
		               |	Прейскурант.Штрихкод
		               |ИЗ
		               |	Справочник.Прейскурант КАК Прейскурант
		               |ГДЕ
		               |	Прейскурант.ЭтоГруппа = ЛОЖЬ
		               |	И Прейскурант.ПометкаУдаления = ЛОЖЬ
		               |	И Прейскурант.Организация = &Организация";
	
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Прейскурант.Ссылка КАК Номенклатура,
		               |	Прейскурант.Штрихкод
		               |ИЗ
		               |	Справочник.Прейскурант КАК Прейскурант
		               |ГДЕ
		               |	Прейскурант.ЭтоГруппа = ЛОЖЬ
		               |	И Прейскурант.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;			   
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТоваров;
	
КонецФункции

&НаСервере
Процедура ИзменитьПометки(Пометка = Неопределено, ТолькоБезШК = Ложь)

	Для каждого ТекСтр Из ТаблицаШтрихкодов Цикл
		
		НовоеЗначениеПометки = ?(Пометка = Неопределено, Не ТекСтр.Пометка, Пометка);
		
		Если НовоеЗначениеПометки = Истина Тогда
			Если (ТолькоБезШК ИЛИ НЕ РазрешатьИзменятьСуществующиеШтрихкоды) И ЗначениеЗаполнено(ТекСтр.Штрихкод) Тогда
				НовоеЗначениеПометки = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ТекСтр.Пометка = НовоеЗначениеПометки;
	
	КонецЦикла;

КонецПроцедуры // ИзменитьПометки()

&НаСервере
Процедура СнятьПометкиСоСтрокСШК()

	Для каждого ТекСтр Из ТаблицаШтрихкодов Цикл
		
		Если ЗначениеЗаполнено(ТекСтр.Штрихкод) Тогда
			ТекСтр.Пометка = Ложь;
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СформироватьШтрихкоды(ТолькоПустые = Ложь)

	МаксимальныйШтрихкод = Неопределено;
	
	Для каждого ТекСтр Из ТаблицаШтрихкодов Цикл
	
		Если ТекСтр.Пометка И (НЕ ТолькоПустые ИЛИ ПустаяСтрока(ТекСтр.Штрихкод)) Тогда
			
			ОбъектПрейскуранта = ТекСтр.Номенклатура.ПолучитьОбъект();
			ОбъектПрейскуранта.Штрихкод = Справочники.Прейскурант.СформироватьШтрихкодEAN13();
			ОбъектПрейскуранта.Записать();
			
			ТекСтр.Штрихкод = ОбъектПрейскуранта.Штрихкод;
			МаксимальныйШтрихкод = ОбъектПрейскуранта.Штрихкод;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // СформироватьШтрихкоды()

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ТаблицаШтрихкодов.Загрузить(ПолучитьСписокТоваров());
КонецПроцедуры

#КонецОбласти
